InformationRegisters/ДМ_СтрокиЗаписейЖурналаРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДМ_СтрокиЗаписейЖурналаРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДанныеЗаписи</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеИмя</Name>
					<Comment>Представление события</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_СобытияЖурналаРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_ТипыПриложений1С</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДМ_УровниЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДМ_СтрокиЗаписейЖурналаРегистрации/Ext/ManagerModule.bsl
// Выполняет регистрацию события в альтернативном журнале регистрации
//
// Параметры:
//	пДанныеЗаписи  - ДокументСсылка, СправочникСсылка - ссылка на данные, связанные с событием
//	пСобытиеИмя - СправочникСсылка.ДМ_СобытияЖурналаРегистрации - Тип события
//	пУровеньЖурнала - ПеречислениеСсылка.ДМ_УровниЖурнала - Уровень важности события журнала регистрации.
//	пОбъектМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Строка - Объект метаданных, к которому относится событие.
//	пДанныеПредставление - Строка - Представление объекта данных, к которому относится событие.
//  пОписаниеСобытия  - Строка - Произвольная строка комментария к событию
//
Процедура ЗарегистрироватьСобытие( 
	пДанныеЗаписи = Неопределено, 
	пСобытиеИмя = Неопределено, 
	пУровеньЖурнала = Неопределено, 
	пОбъектМетаданных = Неопределено,
	пДанныеПредставление = Неопределено,
	пОписаниеСобытия = Неопределено
	) Экспорт

	лНаборЗаписей = РегистрыСведений.ДМ_СтрокиЗаписейЖурналаРегистрации.СоздатьНаборЗаписей();
	лЗапись = лНаборЗаписей.Добавить();
	лЗапись.ДатаСобытия = ТекущаяДатаСеанса();
	лЗапись.ДатаСобытия2 = НачалоДня(лЗапись.ДатаСобытия);
	лЗапись.ДанныеЗаписи = пДанныеЗаписи;
	лСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	лЗапись.Сеанс = лСеанс.НомерСеанса;
	лЗапись.СобытиеИмя = пСобытиеИмя;
	лЗапись.Идентификатор = Новый УникальныйИдентификатор;
	лЗапись.Приложение = Справочники.ДМ_ТипыПриложений1С.НайтиПоКоду(лСеанс.ИмяПриложения);
	лЗапись.УровеньЖурнала = пУровеньЖурнала;
	
	Если ТипЗнч(пОбъектМетаданных) = Тип("Строка") Тогда
		лЗапись.ОбъектМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных( пОбъектМетаданных )		
	Иначе
		лЗапись.ОбъектМетаданных = пОбъектМетаданных;
	КонецЕсли;
	лЗапись.Пользователь = Пользователи.ТекущийПользователь();
	лЗапись.НомерСоединения = лСеанс.НомерСоединения;
	лЗапись.Комментарий = пОписаниеСобытия;
	лЗапись.Компьютер = ИмяКомпьютера();
	лЗапись.ДанныеПредставление = пДанныеПредставление;
	
	Для каждого Измерение Из Метаданные.РегистрыСведений.ДМ_СтрокиЗаписейЖурналаРегистрации.Измерения Цикл
		лНаборЗаписей.Отбор[Измерение.Имя].Установить( лЗапись[Измерение.Имя] );
	КонецЦикла;
	
	лНаборЗаписей.Записать();

КонецПроцедуры // ЗарегистрироватьСобытие()
